app/controllers/gundams_controller.rb

SELECT "gundams".* FROM "gundams"
---
  def index
    @gundams = if params[:search]
                 Gundam.where('name LIKE ?', "%#{params[:search]}%")
               else
                 Gundam.all

INSERT INTO "gundams" ("name", "series", "scale", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Ariel"], ["series", "WFM"], ["scale", "1/144"], ["created_at", "2023-11-12 02:42:27.497013"], ["updated_at", "2023-11-12 02:42:27.497013"]]
---
  def create
    @gundam = Gundam.new(gundam_params)

    respond_to do |format|
      if @gundam.save

SELECT "gundams".* FROM "gundams" WHERE "gundams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_gundam
      @gundam = Gundam.find(params[:id])