app/controllers/tasks_controller.rb

  def index
    @tasks = if params[:search]
      Task.where('name LIKE ?', "%#{params[:search]}%")
    else
      Task.all
---
SELECT "tasks".* FROM "tasks" WHERE (name LIKE '%test%')
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Test Task"], ["description", "this is a test task"], ["created_at", "2023-11-12 02:06:56.731890"], ["updated_at", "2023-11-12 02:06:56.731890"]]

  def destroy
    @task.destroy!
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]